dvtung0611/STM32-Embedded-Framework/drivers/stm32f407/mcu/inc/spi-driver.h
/**
 * File name: spi-driver.h
 *
 * Created on: 01/05/2026
 * Author: Van Tung Dinh
 */

#ifndef INC_SPI_DRIVER_H_
#define INC_SPI_DRIVER_H_

#include <stdint.h>
#include "stm32f407xx.h"


/* ===================================================== MACROS ===================================================== */

/**
 * @SPI_RESET_REGISTER_VALUE
 */
#define SPI_CR1_RESET_VALUE                 (0x00U)
#define SPI_CR2_RESET_VALUE                 (0x00U)
#define SPI_SR_RESET_VALUE                  (0x02U)
#define SPI_DR_RESET_VALUE                  (0x00U)
#define SPI_CRCPR_RESET_VALUE               (0x07U)
#define SPI_RXCRCR_RESET_VALUE              (0x00U)
#define SPI_TXCRCR_RESET_VALUE              (0x00U)
#define SPI_I2SCFGR_RESET_VALUE             (0x00U)
#define SPI_I2SPR_RESET_VALUE               (0x02U)


/* ================================================== DEFINITIONS =================================================== */

/**
 * @SPI_DEVICE_MODE
 */
typedef enum
{
    SPI_DEVICE_MODE_SLAVE = 0U,
    SPI_DEVICE_MODE_MASTER
} SPI_DeviceMode_t;


/**
 * @SPI_BUS_CONFIG
 */
typedef enum
{
    SPI_BUSCONFIG_FULL_DUPLEX = 0U,
    SPI_BUSCONFIG_HALF_DUPLEX,
    SPI_BUSCONFIG_SIMPLEX_RX
} SPI_BusConfig_t;


/**
 * @SPI_SCLK_SPEED
 */
typedef enum
{
    SPI_SCLK_SPEED_DIV_2 = 0U,
    SPI_SCLK_SPEED_DIV_4,
    SPI_SCLK_SPEED_DIV_8,
    SPI_SCLK_SPEED_DIV_16,
    SPI_SCLK_SPEED_DIV_32,
    SPI_SCLK_SPEED_DIV_64,
    SPI_SCLK_SPEED_DIV_128,
    SPI_SCLK_SPEED_DIV_256
} SPI_SCLKSpeed_t;


/**
 * @SPI_DATA_FRAME_FORMAT
 */
typedef enum
{
    SPI_DFF_8BITS = 0U,
    SPI_DFF_16BITS
} SPI_DFF_t;


/**
 * @SPI_CLOCK_POLARITY
 */
typedef enum
{
    SPI_CPOL_LOW = 0U,
    SPI_CPOL_HIGH
} SPI_CPOL_t;


/**
 * @SPI_CLOCK_PHASE
 */
typedef enum
{
    SPI_CPHA_FIRST_CLK = 0U,
    SPI_CPHA_SECOND_CLK
} SPI_CPHA_t;


/**
 * @SPI_SOFTWARE_SLAVE_MANAGEMENT
 */
typedef enum
{
    SPI_SSM_DISABLE = 0U,
    SPI_SSM_ENABLE
} SPI_SSM_t;


/**
 * @SPI_FUNCTION_STATUS
 */
typedef enum
{
    SPI_FUNC_STATUS_OK = 0U,
    SPI_FUNC_STATUS_BUSY,
    SPI_FUNC_STATUS_ERROR,
    SPI_FUNC_STATUS_INVALID_PARAMETER
} SPI_FunctionStatus_t;


/**
 * @SPI_PERIPHERAL_STATE
 */
typedef enum
{
    SPI_PERI_STATE_READY = 0U,

    SPI_PERI_STATE_BUSY_TX_RX,
    SPI_PERI_STATE_TX_RX_COMPLETE,

    SPI_PERI_STATE_BUSY_TX,
    SPI_PERI_STATE_TX_COMPLETE,

    SPI_PERI_STATE_BUSY_RX,
    SPI_PERI_STATE_RX_COMPLETE,

    SPI_PERI_STATE_WAIT_CLOSE,

    SPI_PERI_STATE_ERROR
} SPI_PeripheralState_t;


/**
 * @SPI_PERIPERAL_ERROR
 */
typedef enum
{
    SPI_PERI_ERROR_NONE = 0U,
    SPI_PERI_ERROR_OVR = 1U,
    SPI_PERI_ERROR_MODF = 2U
} SPI_PeripheralError_t;


/**
 * @SPI_IRQ_EVENT
 */
typedef enum
{
    SPI_IRQ_EVENT_NONE = 0U,
    SPI_IRQ_EVENT_TXE = 1U,
    SPI_IRQ_EVENT_RXNE = 2U,
    SPI_IRQ_EVENT_ERROR_OVR = 4U,
    SPI_IRQ_EVENT_ERROR_MODF = 8U
} SPI_IRQEvent_t;


/**
 * @SPI_APP_EVENT
 */
typedef enum
{
    SPI_APP_EVENT_NONE = 0U,
    SPI_APP_EVENT_TX_RX_COMPLETE,
    SPI_APP_EVENT_TX_COMPLETE,
    SPI_APP_EVENT_RX_COMPLETE,
    SPI_APP_EVENT_ERROR_OVR,
    SPI_APP_EVENT_ERROR_MODF
} SPI_AppEvent_t;


/**
 * @SPI_TRANSFER_MODE
 */
typedef enum
{
    SPI_TRANSFER_MODE_NONE = 0U,
    SPI_TRANSFER_MODE_TRANSMIT_ONLY,
    SPI_TRANSFER_MODE_RECEIVE_ONLY,
    SPI_TRANSFER_MODE_TRANSMIT_RECEIVE
} SPI_TransferMode_t;


/* ================================================== BIT POSITION ================================================== */

/**
 * @SPI_CR1
 */
#define SPI_CR1_CPHA_Pos            (0U)    /*!< Clock phase                            | Bit 0 */
#define SPI_CR1_CPOL_Pos            (1U)    /*!< Clock polarity                         | Bit 1 */
#define SPI_CR1_MSTR_Pos            (2U)    /*!< Master selection                       | Bit 2 */
#define SPI_CR1_BR_Pos              (3U)    /*!< Baud rate control                      | Bit 5:3 */
#define SPI_CR1_SPE_Pos             (6U)    /*!< SPI enable                             | Bit 6 */
#define SPI_CR1_LSBFIRST_Pos        (7U)    /*!< LSB/MSB transmission order             | Bit 7 */
#define SPI_CR1_SSI_Pos             (8U)    /*!< Internal slave select                  | Bit 8 */
#define SPI_CR1_SSM_Pos             (9U)    /*!< Software slave management              | Bit 9 */
#define SPI_CR1_RXONLY_Pos          (10U)   /*!< Receive only                           | Bit 10 */
#define SPI_CR1_DFF_Pos             (11U)   /*!< Data frame format                      | Bit 11 */
#define SPI_CR1_CRCNEXT_Pos         (12U)   /*!< CRC transfer next                      | Bit 12 */
#define SPI_CR1_CRCEN_Pos           (13U)   /*!< Hardware CRC calculation enable        | Bit 13 */
#define SPI_CR1_BIDIOE_Pos          (14U)   /*!< Output enable in bidirectional mode    | Bit 14 */
#define SPI_CR1_BIDIMODE_Pos        (15U)   /*!< Bidirectional data mode enable         | Bit 15 */


/**
 * @SPI_CR2
 */
#define SPI_CR2_RXDMAEN_Pos         (0U)    /*!< Rx buffer DMA enable                   | Bit 0 */
#define SPI_CR2_TXDMAEN_Pos         (1U)    /*!< Tx buffer DMA enable                   | Bit 1 */
#define SPI_CR2_SSOE_Pos            (2U)    /*!< SS output enable                       | Bit 2 */
#define SPI_CR2_FRF_Pos             (4U)    /*!< Frame format (Motorola/TI mode)        | Bit 4 */
#define SPI_CR2_ERRIE_Pos           (5U)    /*!< Error interrupt enable                 | Bit 5 */
#define SPI_CR2_RXNEIE_Pos          (6U)    /*!< RX buffer not empty interrupt enable   | Bit 6 */
#define SPI_CR2_TXEIE_Pos           (7U)    /*!< Tx buffer empty interrupt enable       | Bit 7 */


/**
 * @SPI_SR
 */
#define SPI_SR_RXNE_Pos             (0U)    /*!< Receive buffer not empty   | Bit 0 */
#define SPI_SR_TXE_Pos              (1U)    /*!< Transmit buffer empty      | Bit 1 */
#define SPI_SR_CHSIDE_Pos           (2U)    /*!< Channel side               | Bit 2 */
#define SPI_SR_UDR_Pos              (3U)    /*!< Underrun flag              | Bit 3 */
#define SPI_SR_CRCERR_Pos           (4U)    /*!< CRC error flag             | Bit 4 */
#define SPI_SR_MODF_Pos             (5U)    /*!< Mode fault                 | Bit 5 */
#define SPI_SR_OVR_Pos              (6U)    /*!< Overrun flag               | Bit 6 */
#define SPI_SR_BSY_Pos              (7U)    /*!< Busy flag                  | Bit 7 */
#define SPI_SR_FRE_Pos              (8U)    /*!< Frame format error         | Bit 8 */


/* ===================================================== FLAGS ====================================================== */

/**
 * @SPI_FLAG
 */
#define SPI_FLAG_RXNE           (0U)    /*!< Receive buffer not empty   | Bit 0 */
#define SPI_FLAG_TXE            (1U)    /*!< Transmit buffer empty      | Bit 1 */
#define SPI_FLAG_CHSIDE         (2U)    /*!< Channel side               | Bit 2 */
#define SPI_FLAG_UDR            (3U)    /*!< Underrun flag              | Bit 3 */
#define SPI_FLAG_CRCERR         (4U)    /*!< CRC error flag             | Bit 4 */
#define SPI_FLAG_MODF           (5U)    /*!< Mode fault                 | Bit 5 */
#define SPI_FLAG_OVR            (6U)    /*!< Overrun flag               | Bit 6 */
#define SPI_FLAG_BSY            (7U)    /*!< Busy flag                  | Bit 7 */
#define SPI_FLAG_FRE            (8U)    /*!< Frame format error         | Bit 8 */


/* =================================================== STRUCTURES =================================================== */

/**
 * @brief SPI configuration structure
 *
 * @details This structure is used to configure SPI peripheral parameters
 *          such as mode, bus configuration, clock speed, data format, and clock polarity/phase.
 */
typedef struct
{
    __IO SPI_DeviceMode_t SPI_DeviceMode;    /*!< Device mode selection                          | Possible value: @SPI_DEVICE_MODE */
    __IO SPI_BusConfig_t SPI_BusConfig;      /*!< Bus configuration                              | Possible value: @SPI_BUS_CONFIG */
    __IO SPI_SCLKSpeed_t SPI_SCLKSpeed;      /*!< Serial clock speed (baud rate prescaler)       | Possible value: @SPI_SCLK_SPEED */
    __IO SPI_DFF_t SPI_DFF;                  /*!< Data frame format                              | Possible value: @SPI_DATA_FRAME_FORMAT */
    __IO SPI_CPOL_t SPI_CPOL;                /*!< Clock polarity                                 | Possible value: @SPI_CLOCK_POLARITY */
    __IO SPI_CPHA_t SPI_CPHA;                /*!< Clock phase                                    | Possible value: @SPI_CLOCK_PHASE */
    __IO SPI_SSM_t SPI_SSM;                  /*!< Software slave management                      | Possible value: @SPI_SOFTWARE_SLAVE_MANAGEMENT */
} SPI_Config_t;


/**
 * @brief SPI transfer structure
 * 
 * @details This is structure is used to configure SPI transfer
 */
typedef struct
{ 
    __IO uint8_t *pTxBuffer;                /*!< Pointer to TX buffer application data */
    __IO uint8_t *pRxBuffer;                /*!< Pointer to RX buffer application data */
    
